"""
Модуль для об'єднання декількох відсортованих списків у один відсортований список.

Цей модуль використовує функцію `merge_k_sorted_lists`, яка об'єднує k відсортованих списків
у один відсортований список. Це може бути корисно для обробки великих наборів даних або
для комбінування результатів кількох різних процесів у один список.

Запуск файлу `main.py` покаже результат об'єднання заздалегідь визначеного набору списків.
"""

from typing import List
from src.merge_k_sorted_lists import merge_k_sorted_lists

if __name__ == "__main__":
    # Вхідні дані: список відсортованих списків цілих чисел
    lists: List[List[int]] = [[1, 4, 5], [1, 3, 4], [2, 6]]

    # Об'єднання відсортованих списків у один відсортований список
    merged_list: List[int] = merge_k_sorted_lists(lists)

    # Виведення результату
    print("Відсортований список:", merged_list)
